<a href="https://colab.research.google.com/github/krsna540/Hackthons/blob/master/HRAnalytics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import matplotlib.pyplot as plt # for data visualization
import seaborn as sns # for heatmap plot
# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory
# Suppressing Warnings
import warnings
warnings.filterwarnings('ignore')

In [41]:
trainData = pd.read_csv("/content/train_LZdllcl.csv")
testData=pd.read_csv("/content/test_2umaH9m.csv")
print(trainData.shape)
print(testData.shape)

(54808, 14)
(23490, 13)

In [42]:
trainData.head()

   employee_id         department  ... avg_training_score is_promoted
0        65438  Sales & Marketing  ...                 49           0
1        65141         Operations  ...                 60           0
2         7513  Sales & Marketing  ...                 50           0
3         2542  Sales & Marketing  ...                 50           0
4        48945         Technology  ...                 73           0

[5 rows x 14 columns]

In [0]:
from numpy import array
from numpy import argmax
from keras.utils import to_categorical

In [0]:
trainData['region'] = trainData['region'].map(lambda x: int(x.lstrip('region_')))
Gender = {'m': 1,'f': 0}
trainData.gender = [Gender[item] for item in trainData.gender]
trainData = pd.get_dummies(trainData, columns = ['recruitment_channel', 'department', 'education'], drop_first = True)

In [44]:
trainData.head()

   employee_id         department  ... avg_training_score is_promoted
0        65438  Sales & Marketing  ...                 49           0
1        65141         Operations  ...                 60           0
2         7513  Sales & Marketing  ...                 50           0
3         2542  Sales & Marketing  ...                 50           0
4        48945         Technology  ...                 73           0

[5 rows x 14 columns]

In [45]:
testData.head()

   employee_id         department  ... awards_won? avg_training_score
0         8724         Technology  ...           0                 77
1        74430                 HR  ...           0                 51
2        72255  Sales & Marketing  ...           0                 47
3        38562        Procurement  ...           0                 65
4        64486            Finance  ...           0                 61

[5 rows x 13 columns]

In [0]:
testData['region'] = testData['region'].map(lambda x: int(x.lstrip('region_')))
Gender = {'m': 1,'f': 0}
testData.gender = [Gender[item] for item in testData.gender]
testData = pd.get_dummies(testData, columns = ['recruitment_channel', 'department', 'education'], drop_first = True)

In [47]:
testData.head()

   employee_id  region  ...  education_Below Secondary  education_Master's & above
0         8724      26  ...                          0                           0
1        74430       4  ...                          0                           0
2        72255      13  ...                          0                           0
3        38562       2  ...                          0                           0
4        64486      29  ...                          0                           0

[5 rows x 22 columns]

In [0]:
train_x=trainData.drop(['is_promoted'],axis=1)
train_y=trainData['is_promoted']

In [49]:
train_x.head

<bound method NDFrame.head of        employee_id         department  ... awards_won? avg_training_score
0            65438  Sales & Marketing  ...           0                 49
1            65141         Operations  ...           0                 60
2             7513  Sales & Marketing  ...           0                 50
3             2542  Sales & Marketing  ...           0                 50
4            48945         Technology  ...           0                 73
5            58896          Analytics  ...           0                 85
6            20379         Operations  ...           0                 59
7            16290         Operations  ...           0                 63
8            73202          Analytics  ...           0                 83
9            28911  Sales & Marketing  ...           0                 54
10           29934         Technology  ...           0                 77
11           49017  Sales & Marketing  ...           0                 50
12           60051  Sales & Marketing  ...           0                 49
13           38401         Technology  ...           0                 80
14           77040                R&D  ...           0                 84
15           43931         Operations  ...           0                 60
16            7152         Technology  ...           0                 77
17            9403  Sales & Marketing  ...           0                 51
18           17436  Sales & Marketing  ...           0                 46
19           54461         Operations  ...           0                 59
20           12067        Procurement  ...           0                 75
21           33332         Operations  ...           0                 57
22           58789            Finance  ...           0                 63
23           71177        Procurement  ...           0                 70
24           52057            Finance  ...           0                 59
25           26585         Technology  ...           0                 83
26           37749        Procurement  ...           0                 68
27            2370         Technology  ...           0                 79
28            8219          Analytics  ...           0                 80
29           74759  Sales & Marketing  ...           0                 44
...            ...                ...  ...         ...                ...
54778        30691        Procurement  ...           0                 70
54779        49923         Technology  ...           0                 86
54780        73767         Operations  ...           0                 60
54781        76497                 HR  ...           0                 50
54782        17281         Operations  ...           0                 60
54783        45504        Procurement  ...           0                 71
54784        68370  Sales & Marketing  ...           0                 48
54785        42055         Technology  ...           0                 77
54786        32291  Sales & Marketing  ...           0                 51
54787        77455         Technology  ...           0                 84
54788        75164  Sales & Marketing  ...           0                 48
54789        75942  Sales & Marketing  ...           0                 50
54790        67988                 HR  ...           0                 49
54791        27274         Technology  ...           0                 82
54792          994  Sales & Marketing  ...           0                 65
54793        28400         Technology  ...           0                 79
54794        35000         Operations  ...           0                 54
54795        13477        Procurement  ...           0                 70
54796        12592  Sales & Marketing  ...           0                 60
54797        62450  Sales & Marketing  ...           1                 47
54798        40257  Sales & Marketing  ...           0                 51
54799        68093        Procurement  ...           1                 67
54800        39227                 HR  ...           0                 52
54801        12431         Technology  ...           0                 78
54802         6915  Sales & Marketing  ...           0                 49
54803         3030         Technology  ...           0                 78
54804        74592         Operations  ...           0                 56
54805        13918          Analytics  ...           0                 79
54806        13614  Sales & Marketing  ...           0                 45
54807        51526                 HR  ...           0                 49

[54808 rows x 13 columns]>